#include <rbus/hdmirx_2p1_phy_reg.h>
#include <rbus/efuse_reg.h>

#define HDMI_APHY0_BASE	    (0xb800DA20)   //DA20 ~ DAEC (P0)   
#define HDMI_APHY1_BASE	    (0xb800DB20)  //DB20 ~ DBEC(P1)

#define HDMI_DPHY0_BASE	    (0xb800DC00)   //DC00 ~ DCD8 (P0) 
#define HDMI_DPHY1_BASE	    (0xb800DD00)   // DD00 ~ DDD8(P1) 


struct hdmi21_aphy_reg_st {
	uint32_t top_out_0;  //DA20
	uint32_t top_out_1; //DA24
	uint32_t koffset;  //DA28
	uint32_t ck_cmu;  //DA2C
	uint32_t ck0; //DA30
	uint32_t ck1; //DA34
	uint32_t ck2; //DA38
	uint32_t ck3; //DA3C
	uint32_t ck4; //DA40
	uint32_t acdr_ck0;  //DA44
	uint32_t acdr_ck1;  //DA48
	uint32_t acdr_ck2;  //DA4C
	uint32_t b0;  //DA50
	uint32_t b1;  //DA54
	uint32_t b2;  //DA58
	uint32_t b3;  //DA5C
	uint32_t b4;  //DA60
	uint32_t acdr_b0;  //DA64
	uint32_t acdr_b1;  //DA68
	uint32_t acdr_b2;  //DA6C
	uint32_t g0;  //DA70
	uint32_t g1;  //DA74
	uint32_t g2;  //DA78
	uint32_t g3;  //DA7C
	uint32_t g4;  //DA80
	uint32_t acdr_g0;  //DA84
	uint32_t acdr_g1;  //DA88
	uint32_t acdr_g2;  //DA8C
	uint32_t r0;  //DA90
	uint32_t r1;  //DA94
	uint32_t r2;  //DA98
	uint32_t r3;  //DA9C
	uint32_t r4;  //DAA0
	uint32_t acdr_r0;  //DAA4
	uint32_t acdr_r1;  //DAA8
	uint32_t acdr_r2;  //DAAC
	uint32_t hd21_y1_rst;  //DAB0

	uint32_t rsvd1;  //DAB4;
	uint32_t rsvd2;  //DAB8
	uint32_t rsvd3;  //DABC
	
	
	uint32_t acdr_r_pll_cfg;  //DAC0
	uint32_t acdr_g_pll_cfg;  //DAC4
	uint32_t acdr_b_pll_cfg;  //DAC8
	uint32_t acdr_ck_pll_cfg;  //DACC
	uint32_t acdr_r_cdr_cfg;  //DAD0
	uint32_t acdr_g_cdr_cfg;  //DAD4
	uint32_t acdr_b_cdr_cfg;  //DAD8
	uint32_t acdr_ck_cdr_cfg;  //DADC
	uint32_t acdr_r_manual_cfg;  //DAE0
	uint32_t acdr_g_manual_cfg;  //DAE4
	uint32_t acdr_b_manual_cfg;  //DAE8
	uint32_t acdr_ck_manual_cfg;  //DAEC
};


extern const struct hdmi21_aphy_reg_st *hd21_aphy[2];

#define  HDMIRX_PHY_TOP_OUT_0_reg		(unsigned int)(&hd21_aphy[nport]->top_out_0)
#define  HDMIRX_PHY_TOP_OUT_1_reg		(unsigned int)(&hd21_aphy[nport]->top_out_1)
#define  HDMIRX_PHY_KOFFSET_reg		(unsigned int)(&hd21_aphy[nport]->koffset)
#define  HDMIRX_PHY_CK_CMU_reg			(unsigned int)(&hd21_aphy[nport]->ck_cmu)

#define HDMIRX_PHY_CK0_reg				  (unsigned int)(&hd21_aphy[nport]->ck0)
#define HDMIRX_PHY_CK1_reg				  (unsigned int)(&hd21_aphy[nport]->ck1)
#define HDMIRX_PHY_CK2_reg				  (unsigned int)(&hd21_aphy[nport]->ck2)
#define HDMIRX_PHY_CK3_reg				  (unsigned int)(&hd21_aphy[nport]->ck3)
#define HDMIRX_PHY_CK4_reg				  (unsigned int)(&hd21_aphy[nport]->ck4)
#define HDMIRX_PHY_ACDR_CK0_reg             (unsigned int)(&hd21_aphy[nport]->acdr_ck0)
#define HDMIRX_PHY_ACDR_CK1_reg             (unsigned int)(&hd21_aphy[nport]->acdr_ck1)
#define HDMIRX_PHY_ACDR_CK2_reg             (unsigned int)(&hd21_aphy[nport]->acdr_ck2)


#define HDMIRX_PHY_B0_reg				  (unsigned int)(&hd21_aphy[nport]->b0)
#define HDMIRX_PHY_B1_reg				  (unsigned int)(&hd21_aphy[nport]->b1)
#define HDMIRX_PHY_B2_reg				  (unsigned int)(&hd21_aphy[nport]->b2)
#define HDMIRX_PHY_B3_reg				  (unsigned int)(&hd21_aphy[nport]->b3)
#define HDMIRX_PHY_B4_reg				  (unsigned int)(&hd21_aphy[nport]->b4)
#define HDMIRX_PHY_ACDR_B0_reg               (unsigned int)(&hd21_aphy[nport]->acdr_b0)
#define HDMIRX_PHY_ACDR_B1_reg               (unsigned int)(&hd21_aphy[nport]->acdr_b1)
#define HDMIRX_PHY_ACDR_B2_reg               (unsigned int)(&hd21_aphy[nport]->acdr_b2)


#define HDMIRX_PHY_G0_reg				  (unsigned int)(&hd21_aphy[nport]->g0)
#define HDMIRX_PHY_G1_reg				  (unsigned int)(&hd21_aphy[nport]->g1)
#define HDMIRX_PHY_G2_reg				  (unsigned int)(&hd21_aphy[nport]->g2)
#define HDMIRX_PHY_G3_reg				  (unsigned int)(&hd21_aphy[nport]->g3)
#define HDMIRX_PHY_G4_reg				  (unsigned int)(&hd21_aphy[nport]->g4)
#define HDMIRX_PHY_ACDR_G0_reg               (unsigned int)(&hd21_aphy[nport]->acdr_g0)
#define HDMIRX_PHY_ACDR_G1_reg               (unsigned int)(&hd21_aphy[nport]->acdr_g1)
#define HDMIRX_PHY_ACDR_G2_reg               (unsigned int)(&hd21_aphy[nport]->acdr_g2)

#define HDMIRX_PHY_R0_reg				  (unsigned int)(&hd21_aphy[nport]->r0)
#define HDMIRX_PHY_R1_reg				  (unsigned int)(&hd21_aphy[nport]->r1)
#define HDMIRX_PHY_R2_reg				  (unsigned int)(&hd21_aphy[nport]->r2)
#define HDMIRX_PHY_R3_reg				  (unsigned int)(&hd21_aphy[nport]->r3)
#define HDMIRX_PHY_R4_reg				  (unsigned int)(&hd21_aphy[nport]->r4)
#define HDMIRX_PHY_ACDR_R0_reg               (unsigned int)(&hd21_aphy[nport]->acdr_r0)
#define HDMIRX_PHY_ACDR_R1_reg               (unsigned int)(&hd21_aphy[nport]->acdr_r1)
#define HDMIRX_PHY_ACDR_R2_reg               (unsigned int)(&hd21_aphy[nport]->acdr_r2)

#define HDMIRX_PHY_Y1_RST_reg			  		(unsigned int)(&hd21_aphy[nport]->hd21_y1_rst)

#define HDMIRX_PHY_ACDR_R_PLL_CONFIG_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r_pll_cfg)
#define HDMIRX_PHY_ACDR_G_PLL_CONFIG_reg		(unsigned int)(&hd21_aphy[nport]->acdr_g_pll_cfg)
#define HDMIRX_PHY_ACDR_B_PLL_CONFIG_reg		(unsigned int)(&hd21_aphy[nport]->acdr_b_pll_cfg)
#define HDMIRX_PHY_ACDR_CK_PLL_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_ck_pll_cfg)


#define HDMIRX_PHY_ACDR_R_CDR_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_r_cdr_cfg)
#define HDMIRX_PHY_ACDR_G_CDR_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_g_cdr_cfg)
#define HDMIRX_PHY_ACDR_B_CDR_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_b_cdr_cfg)
#define HDMIRX_PHY_ACDR_CK_CDR_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_ck_cdr_cfg)


#define HDMIRX_PHY_ACDR_R_MANUAL_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_r_manual_cfg)
#define HDMIRX_PHY_ACDR_G_MANUAL_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_g_manual_cfg)
#define HDMIRX_PHY_ACDR_B_MANUAL_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_b_manual_cfg)
#define HDMIRX_PHY_ACDR_CK_MANUAL_CONFIG_reg	(unsigned int)(&hd21_aphy[nport]->acdr_ck_manual_cfg)


struct hdmi21_dphy_reg_st {
	uint32_t regd00;  //DC00
	uint32_t regd01;  //DC04
	uint32_t regd02;  //DC08
	uint32_t regd03;  //DC0C
	uint32_t regd04;  //DC10
	uint32_t regd05;  //DC14
	uint32_t regd06;  //DC18
	uint32_t regd07;  //DC1C
	uint32_t regd08;  //DC20
	uint32_t regd09;  //DC24
	uint32_t fld_r_regd00;  //DC28
	uint32_t fld_r_regd01;  //DC2C
	uint32_t fld_r_regd02;  //DC30
	uint32_t fld_r_regd03;  //DC34
	uint32_t fld_r_regd04;  //DC38
	uint32_t fld_r_regd05;  //DC3C
	uint32_t fld_r_regd06;  //DC40

	uint32_t fld_g_regd00;  //DC44
	uint32_t fld_g_regd01;  //DC48
	uint32_t fld_g_regd02;  //DC4C
	uint32_t fld_g_regd03;  //DC50
	uint32_t fld_g_regd04;  //DC54
	uint32_t fld_g_regd05;  //DC58
	uint32_t fld_g_regd06;  //DC5C

	uint32_t fld_b_regd00;  //DC60
	uint32_t fld_b_regd01;  //DC64
	uint32_t fld_b_regd02;  //DC68
	uint32_t fld_b_regd03;  //DC6C
	uint32_t fld_b_regd04;  //DC70
	uint32_t fld_b_regd05;  //DC74
	uint32_t fld_b_regd06;  //DC78

	uint32_t fld_ck_regd00; //DC7C
	uint32_t fld_ck_regd01; //DC80
	uint32_t fld_ck_regd02; //DC84
	uint32_t fld_ck_regd03; //DC88
	uint32_t fld_ck_regd04; //DC8C
	uint32_t fld_ck_regd05; //DC90
	uint32_t fld_ck_regd06; //DC94
	
	uint32_t misc_0; //DC98
	
	uint32_t regd10;  //DC9C
	uint32_t regd11;  //DCA0
	uint32_t regd12;  //DCA4
	uint32_t regd13;  //DCA8
	uint32_t regd14;  //DCAC
	uint32_t regd15;  //DCB0
	uint32_t regd16;  //DCB4
	uint32_t regd17;  //DCB8
	uint32_t regd18;  //DCBC
	uint32_t regd19;  //DCC0
	uint32_t regd20;  //DCC4
	uint32_t regd21;  //DCC8
	uint32_t regd22;  //DCCC
	uint32_t regd23;  //DCD0
	uint32_t regd24;  //DCD4
	uint32_t regd25;  //DCD8
	
};


extern const struct hdmi21_dphy_reg_st *hd21_dphy[2];

#define HDMIRX_PHY_REGD00_reg	(unsigned int)(&hd21_dphy[nport]->regd00)
#define HDMIRX_PHY_REGD01_reg	(unsigned int)(&hd21_dphy[nport]->regd01)
#define HDMIRX_PHY_REGD02_reg	(unsigned int)(&hd21_dphy[nport]->regd02)
#define HDMIRX_PHY_REGD03_reg	(unsigned int)(&hd21_dphy[nport]->regd03)
#define HDMIRX_PHY_REGD04_reg	(unsigned int)(&hd21_dphy[nport]->regd04)
#define HDMIRX_PHY_REGD05_reg	(unsigned int)(&hd21_dphy[nport]->regd05)
#define HDMIRX_PHY_REGD06_reg	(unsigned int)(&hd21_dphy[nport]->regd06)
#define HDMIRX_PHY_REGD07_reg	(unsigned int)(&hd21_dphy[nport]->regd07)
#define HDMIRX_PHY_REGD08_reg	(unsigned int)(&hd21_dphy[nport]->regd08)
#define HDMIRX_PHY_REGD09_reg	(unsigned int)(&hd21_dphy[nport]->regd09)


#define HDMIRX_PHY_FLD_R_REGD00_reg	(unsigned int)(&hd21_dphy[nport]->fld_r_regd00)
#define HDMIRX_PHY_FLD_R_REGD01_reg	(unsigned int)(&hd21_dphy[nport]->fld_r_regd01)
